In [2]:
import pandas as pd
df=pd.read_csv("income.csv")
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [3]:
df.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [6]:
df.loc[0:]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [53]:
# Accessing particular columns
s=0
for i in df["2008"]:
    print(i)
    s=s+i
s

44476
63989
46914
39586
57014

251979

In [16]:
s=0    ###  finding particular columns and finding average
c=0
for i in df["2010"]:
    print(i)
    s=s+i
    c=c+1
print(s/c)

40933
57848
46896
38587
54283
47709.4

In [25]:
## Accessing a particular row and finding sum
s=0
for i in df.iloc[1,2:]:
    print(i)
    s=s+i
s

55891
56418
62993
63989
61604
57848
57431
63648
61137

540959

In [26]:
## finding sum to a particular column
df["2010"].sum()

238547

In [29]:
## finding sum to a particular row
df.iloc[4,2:].sum()

498154

In [49]:
s=0
a=df.loc[0:,"2005":"2008"].sum()
for i in a:
    s=s+i
s

976808

In [55]:
a=df.loc[0:,"2005":"2008"].sum() ## Another method
a.sum()

976808

In [57]:
a=df.loc[0:,"2005":].sum()
a.sum()

2199422

In [58]:
a=df.iloc[0:,2:].sum()
a.sum()

2199422

In [62]:
df.sum() ## to find the total sum of all in dividual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [63]:
df.sum(1)###  to find the total sum of all in dividual rows

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

In [81]:
## prod() to find the product
k=df.iloc[1:3,2:6].prod()
k.prod()

3892897880436685324

In [93]:
#mean() to find the average
#df.iloc[:,8:9].mean()
df["2011"].mean()

48662.2

In [90]:
## find the avg of 2nd row
df.iloc[2,2:].mean()

48967.88888888889

In [94]:
## median()------>middle value
df["2011"].median()

48621.0

In [95]:
## median()------>middle value
df.iloc[2,2:].median()

46914.0

In [189]:
import pandas as pd
df=pd.read_csv("income.csv",index_col="State")
df

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [190]:
## Combined Average Income of all states from 2005 to 2013
df.iloc[:,2:].mean().mean()### column wis average
#df.iloc[:,2:].mean(1).mean()## row wise averag

49318.075

In [192]:
df.iloc[:,-3:].mean(1)

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [173]:
## State with highest average income in the last three years
df.iloc[:,-3:].mean(1).idxmax()

'Alaska'

In [198]:
df["lyears"]=df.iloc[:,-3:].mean(1)
df

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,lyearss,lyears
State,,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,42478.333333,41986.493827
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,60738.666667,61038.209877
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,48755.666667,49581.246914
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,40079.666667,39962.987654
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,55971.666667,56759.839506

In [201]:
df["lyears"]==max(df["lyears"])

State
Alabama       False
Alaska         True
Arizona       False
Arkansas      False
California    False
Name: lyears, dtype: bool

In [204]:
#State with lowest average income from 2007 to 2010(inclusive)
df.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

In [212]:
#print the list of all states in the same line with average income 
#less than California
a=df.iloc[:,2:].mean(1)
a

State
Alabama       41745.282716
Alaska        60684.487654
Arizona       49380.291358
Arkansas      39284.465432
California    55913.050617
dtype: float64

In [240]:
a=df.iloc[-1,2:].mean()
a

55913.05061728395

In [241]:
list(df[df.iloc[:,2:].mean(1)<a].index)

['Alabama', 'Arizona', 'Arkansas']

In [248]:
#Print the names of states based on descending order of 
#income in the year 2009
#df[["2009"]]
a=df.iloc[:,6]
a

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [250]:
b=a.sort_values(ascending=False)
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

In [257]:
#state with the lowest recorded income from 2005 to 2013'''
df.iloc[:,2:].idxmin()

2006       Arkansas
2007       Arkansas
2008       Arkansas
2009       Arkansas
2010       Arkansas
2011       Arkansas
2012       Arkansas
2013       Arkansas
lyearss    Arkansas
lyears     Arkansas
dtype: object